pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_used_routines.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                      File 'pic18_used_routines.cpp'                       *
//                        Generated by version 2.5.0                         *
//                     october 12th, 2013, at 13h12'33"                      *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_used_routines.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_used_routines.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//             Routine 'addPic18UsedRoutinesFromInstructionList'             *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_addPic_31__38_UsedRoutinesFromInstructionList (const GALGAS_pic_31__38_InstructionList constinArgument0,
                                                            GALGAS_stringset & ioArgument1,
                                                            C_Compiler * inCompiler
                                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//             Routine 'addPic18UsedRoutinesFromInstructionList'             *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_addPic_31__38_UsedRoutinesFromInstructionList (const GALGAS_pic_31__38_InstructionList constinArgument_inInstructionList,
                                                            GALGAS_stringset & ioArgument_ioUsedRoutines,
                                                            C_Compiler * inCompiler
                                                            COMMA_UNUSED_LOCATION_ARGS) {
  cEnumerator_pic_31__38_InstructionList enumerator_7227 (constinArgument_inInstructionList, kEnumeration_up) ;
  while (enumerator_7227.hasCurrentObject ()) {
    callCategoryMethod_addUsedRoutines ((const cPtr_pic_31__38_PiccoloInstruction *) enumerator_7227.current_mInstruction (HERE).ptr (), ioArgument_ioUsedRoutines, inCompiler COMMA_SOURCE_FILE_AT_LINE (250)) ;
    enumerator_7227.gotoNextObject () ;
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//                   Function 'pic18_computeUsedRoutines'                    *
//                                                                           *
//---------------------------------------------------------------------------*

GALGAS_stringset function_pic_31__38__5F_computeUsedRoutines (const GALGAS_pic_31__38_InterruptDefinitionList & constinArgument_inInterruptDefinitionList,
                                                              const GALGAS_pic_31__38_RoutineDefinitionList & constinArgument_inRoutineDefinitionList,
                                                              const GALGAS_routineDeclarationList & constinArgument_inBootloaderRoutineDeclarationListForBootloaderImplementation,
                                                              const GALGAS_routineDeclarationList & constinArgument_inUserRoutineDeclarationListForUserProgramImplementation,
                                                              C_Compiler * inCompiler
                                                              COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_stringset result_outUsedRoutineSet ; // Returned variable
  result_outUsedRoutineSet = GALGAS_stringset::constructor_setWithString (GALGAS_string ("main") COMMA_SOURCE_FILE_AT_LINE (264)) ;
  cEnumerator_pic_31__38_InterruptDefinitionList enumerator_7930 (constinArgument_inInterruptDefinitionList, kEnumeration_up) ;
  while (enumerator_7930.hasCurrentObject ()) {
    {
    routine_addPic_31__38_UsedRoutinesFromInstructionList (enumerator_7930.current_mInstructionList (HERE), result_outUsedRoutineSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (267)) ;
    }
    enumerator_7930.gotoNextObject () ;
  }
  cEnumerator_routineDeclarationList enumerator_8157 (constinArgument_inBootloaderRoutineDeclarationListForBootloaderImplementation, kEnumeration_up) ;
  while (enumerator_8157.hasCurrentObject ()) {
    result_outUsedRoutineSet.addAssign_operation (enumerator_8157.current_mRoutineName (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (274)) ;
    enumerator_8157.gotoNextObject () ;
  }
  cEnumerator_routineDeclarationList enumerator_8320 (constinArgument_inUserRoutineDeclarationListForUserProgramImplementation, kEnumeration_up) ;
  while (enumerator_8320.hasCurrentObject ()) {
    result_outUsedRoutineSet.addAssign_operation (enumerator_8320.current_mRoutineName (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (278)) ;
    enumerator_8320.gotoNextObject () ;
  }
  GALGAS_stringset var_s = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (281)) ;
  if (constinArgument_inRoutineDefinitionList.reader_length (SOURCE_FILE_AT_LINE (282)).isValid ()) {
    PMUInt32 variant_8463 = constinArgument_inRoutineDefinitionList.reader_length (SOURCE_FILE_AT_LINE (282)).uintValue () ;
    bool loop_8463 = true ;
    while (loop_8463) {
      loop_8463 = GALGAS_bool (kIsNotEqual, var_s.objectCompare (result_outUsedRoutineSet)).isValid () ;
      if (loop_8463) {
        loop_8463 = GALGAS_bool (kIsNotEqual, var_s.objectCompare (result_outUsedRoutineSet)).boolValue () ;
      }
      if (loop_8463 && (0 == variant_8463)) {
        loop_8463 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (282)) ;
      }
      if (loop_8463) {
        variant_8463 -- ;
        var_s = result_outUsedRoutineSet ;
        cEnumerator_pic_31__38_RoutineDefinitionList enumerator_8598 (constinArgument_inRoutineDefinitionList, kEnumeration_up) ;
        while (enumerator_8598.hasCurrentObject ()) {
          const enumGalgasBool test_0 = result_outUsedRoutineSet.reader_hasKey (enumerator_8598.current_mRoutineName (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (286)).boolEnum () ;
          if (kBoolTrue == test_0) {
            {
            routine_addPic_31__38_UsedRoutinesFromInstructionList (enumerator_8598.current_mInstructionList (HERE), result_outUsedRoutineSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (287)) ;
            }
          }
          enumerator_8598.gotoNextObject () ;
        }
      }
    }
  }
//---
  return result_outUsedRoutineSet ;
}


//---------------------------------------------------------------------------*
//  Function introspection                                                   *
//---------------------------------------------------------------------------*

static const C_galgas_type_descriptor * functionArgs_pic_31__38__5F_computeUsedRoutines [5] = {
  & kTypeDescriptor_GALGAS_pic_31__38_InterruptDefinitionList,
  & kTypeDescriptor_GALGAS_pic_31__38_RoutineDefinitionList,
  & kTypeDescriptor_GALGAS_routineDeclarationList,
  & kTypeDescriptor_GALGAS_routineDeclarationList,
  NULL
} ;

//---------------------------------------------------------------------------*

static GALGAS_object functionWithGenericHeader_pic_31__38__5F_computeUsedRoutines (C_Compiler * inCompiler,
                                                                                   const cObjectArray & inEffectiveParameterArray,
                                                                                   const GALGAS_location & /* §§ inErrorLocation */
                                                                                   COMMA_LOCATION_ARGS) {
  const GALGAS_pic_31__38_InterruptDefinitionList operand0 = GALGAS_pic_31__38_InterruptDefinitionList::extractObject (inEffectiveParameterArray.objectAtIndex (0 COMMA_HERE),
                                                                                                                       inCompiler
                                                                                                                       COMMA_THERE) ;
  const GALGAS_pic_31__38_RoutineDefinitionList operand1 = GALGAS_pic_31__38_RoutineDefinitionList::extractObject (inEffectiveParameterArray.objectAtIndex (1 COMMA_HERE),
                                                                                                                   inCompiler
                                                                                                                   COMMA_THERE) ;
  const GALGAS_routineDeclarationList operand2 = GALGAS_routineDeclarationList::extractObject (inEffectiveParameterArray.objectAtIndex (2 COMMA_HERE),
                                                                                               inCompiler
                                                                                               COMMA_THERE) ;
  const GALGAS_routineDeclarationList operand3 = GALGAS_routineDeclarationList::extractObject (inEffectiveParameterArray.objectAtIndex (3 COMMA_HERE),
                                                                                               inCompiler
                                                                                               COMMA_THERE) ;
  return function_pic_31__38__5F_computeUsedRoutines (operand0,
                                                      operand1,
                                                      operand2,
                                                      operand3,
                                                      inCompiler
                                                      COMMA_THERE).reader_object (THERE) ;
}

//---------------------------------------------------------------------------*

